<a href="https://colab.research.google.com/github/Abdyrasul/tensorflow_scripts/blob/master/Python_%7C_Pandas_Merging%2C_Joining%2C_and_Concatenating.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [3]:
data1 = {'Name':['Ahmet', 'Mehmet', 'Ali', 'Hakan'],
        'Age':[22,25,23,23],
        'City': ['Mersin', 'Mugla', 'Istanbul', 'Ankara']}
data1 = {'Name':['Mert', 'Furkan', 'Fatih', 'Muhammet'],
        'Age':[22,25,23,23],
        'City': ['Yalova', 'Bursa', 'Eskishehir', 'Izmir']}

df = pd.DataFrame(data1, index = [0,1,2,3])
df1 = pd.DataFrame(data1, index= [4,5,6,7])
print(df, "\n\n", df1)

   Age        City      Name
0   22      Yalova      Mert
1   25       Bursa    Furkan
2   23  Eskishehir     Fatih
3   23       Izmir  Muhammet

    Age        City      Name
4   22      Yalova      Mert
5   25       Bursa    Furkan
6   23  Eskishehir     Fatih
7   23       Izmir  Muhammet

In [4]:
frames = [df,df1]
result = pd.concat(frames)
print(result)

   Age        City      Name
0   22      Yalova      Mert
1   25       Bursa    Furkan
2   23  Eskishehir     Fatih
3   23       Izmir  Muhammet
4   22      Yalova      Mert
5   25       Bursa    Furkan
6   23  Eskishehir     Fatih
7   23       Izmir  Muhammet

In [0]:
##Concatenating DataFrame by setting logic on axes

In [15]:
data3 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 
   
# Define a dictionary containing employee data 
data4 = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]} 

df2 = pd.DataFrame(data3, index=[0,1,2,3])
df3 = pd.DataFrame(data4, index=[2,3,6,7])
print(df2, '\n\n', df3)

     Address  Age  Mobile No    Name Qualification
0     Nagpur   27         97     Jai           Msc
1     Kanpur   24         91  Princi            MA
2  Allahabad   22         58  Gaurav           MCA
3    Kannuaj   32         76    Anuj           Phd

      Address  Age    Name Qualification  Salary
2  Allahabad   22  Gaurav           MCA    1000
3    Kannuaj   32    Anuj           Phd    2000
6  Allahabad   12  Dhiraj          Bcom    3000
7    Kannuaj   52  Hitesh        B.hons    4000

In [16]:
#applying concat with axes
res2 = pd.concat([df2, df3], axis=1, join = 'inner')
print(res2)

     Address  Age  Mobile No    Name Qualification    Address  Age    Name  \
2  Allahabad   22         58  Gaurav           MCA  Allahabad   22  Gaurav
3    Kannuaj   32         76    Anuj           Phd    Kannuaj   32    Anuj

  Qualification  Salary
2           MCA    1000
3           Phd    2000

In [18]:
res3 = pd.concat([df2,df3], axis = 1, join_axes = [df2.index])
res3

,Address,Age,Mobile No,Name,Qualification,Address,Age,Name,Qualification,Salary
0,Nagpur,27,97,Jai,Msc,NaN,NaN,NaN,NaN,NaN
1,Kanpur,24,91,Princi,MA,NaN,NaN,NaN,NaN,NaN
2,Allahabad,22,58,Gaurav,MCA,Allahabad,22.0,Gaurav,MCA,1000.0
3,Kannuaj,32,76,Anuj,Phd,Kannuaj,32.0,Anuj,Phd,2000.0